export const fakeExhibitions = [
    {
        id: 1,
        image: '/media/images/home/02.jpg',
        title: 'Выставка 1',
        preview_text: 'В среду 18 апреля пройдёт выставка собак всех пород при содействии РКФ технологии/В среду 18 апреля пройдёт выставка собак всех пород при содействии РКФ технологии'
    },
    {
        id: 2,
        image: '/media/images/home/03.jpeg',
        title: 'Выставка 2',
        preview_text: 'В среду 18 апреля пройдёт выставка собак всех пород при содействии РКФ технологии'
    },
    {
        id: 3,
        image: '/media/images/home/04.jpg',
        title: 'Выставка 3',
        preview_text: 'В среду 18 апреля пройдёт выставка собак всех пород при содействии РКФ технологии'
    },
    {
        id: 4,
        image: '/media/images/home/05.jpg',
        title: 'Выставка 4',
        preview_text: 'В среду 18 апреля пройдёт выставка собак всех пород при содействии РКФ технологии'
    },
    {
        id: 5,
        image: '/media/images/home/02.jpg',
        title: 'Выставка 5',
        preview_text: 'В среду 18 апреля пройдёт выставка собак всех пород при содействии РКФ технологии'
    },
    {
        id: 6,
        image: '/media/images/home/03.jpeg',
        title: 'Выставка 6',
        preview_text: 'В среду 18 апреля пройдёт выставка собак всех пород при содействии РКФ технологии'
    },
    {
        id: 7,
        image: '/media/images/home/04.jpg',
        title: 'Выставка 7',
        preview_text: 'В среду 18 апреля пройдёт выставка собак всех пород при содействии РКФ технологии'
    }
];