export const priceTableData=[
    {
        id:1,
        class: 'Вэби',
        month1: 600,
        month2: 1600,
        month3: 2600,
    },
    {
        id:2,
        class: 'Щенки',
        month1: 1100,
        month2: 2100,
        month3: 3100,
    },
    {
        id:3,
        class: 'Юниоры',
        month1: 1600,
        month2: 2600,
        month3: 3600,
    },
    {
        id:4,
        class: 'Промежуточный',
        month1: 2600,
        month2: 1600,
        month3: 2600,
    },
    {
        id:5,
        class: 'Открытый',
        month1: 600,
        month2: 1600,
        month3: 2600,
    },
    {
        id:6,
        class: 'Рабочий',
        month1: 600,
        month2: 1600,
        month3: 2600,
    },
    {
        id:7,
        class: 'Чемпионы',
        month1: 600,
        month2: 1600,
        month3: 2600,
    },
    {
        id:8,
        class: 'Ветераны',
        month1: 600,
        month2: 1600,
        month3: 2600,
    },
];

export const contestTableData = [
    {
        id: 1,
        name: 'Конкурс питомников',
        price: 1000,
    },
    {
        id: 2,
        name: 'Конкурс пар',
        price: 1000,
    },
    {
        id: 3,
        name: 'Конкурс производителей',
        price: 1000,
    },
];
const detailsSchedule = [
    {
        date: '2019-05-25',
        events: [
            {
                start: '07:30',
                title: 'Открытие выставки',
            },
            {
                start: '08:00',
                title: 'Начало ветеренарно   инспекции (для ранее нарисованных экспонентов)',
            },
            {
                start: '08:30',
                title: 'Открытие шоу-офиса',
            },
            {
                start: '9:00',
                title: 'Судейство',
            },
            {
                start: '10:00',
                title: 'Перерыв',
            },
            {
                start: '11:00',
                title: 'Финал 1',
            },
            {
                start: '12:00',
                title: 'Судейство',
            },
            {
                start: '13:00',
                title: 'Финал 2',
            },
            {
                start: '14:00',
                title: 'Финал 3',
            },
            {
                start: '15:00',
                title: 'Вечеринка победителей',
            },
        ]
    },
    {
        date: '2019-05-25',
        events: [
            {
                start: '07:30',
                title: 'Открытие выставки',
            },
            {
                start: '08:00',
                title: 'Начало ветеренарно   инспекции (для ранее нарисованных экспонентов)',
            },
            {
                start: '08:30',
                title: 'Открытие шоу-офиса',
            },
            {
                start: '9:00',
                title: 'Судейство',
            },
            {
                start: '10:00',
                title: 'Перерыв',
            },
            {
                start: '11:00',
                title: 'Финал 1',
            },
            {
                start: '12:00',
                title: 'Судейство',
            },
            {
                start: '13:00',
                title: 'Финал 2',
            },
            {
                start: '14:00',
                title: 'Финал 3',
            },
            {
                start: '15:00',
                title: 'Вечеринка победителей',
            },
        ]
    }
]

export const exhibitionDetails = {
    id: 2,
    title: 'Интернациональная выставка собак «мемориал А. П. Мазовера 2019»',
    owner: {
        name: 'РКФ',
        site: 'www.rkf.org.ru',
        logo: ''
    },
    images: [
        {
            id: 1,
            url: '/static/images/noimg/details.svg'
        },
    ],
    date: {
        start: '2019-05-25 12:00',
        end: '2019-05-26 12:00',
    },
    place: {
        city: "г. Красногорск",
        place: "Крокус Экспо — Международный выставочный центр"
    },
    standard: 'FCI',
    rang: 'CACIB',
    dog_breed: 'Все породы',
    description: "<p>Участвуют собаки всех пород, признанных FCI. Для пород, не признанных FCI, но признанных РКФ, в рамках интернациональной выставки «Мемориал А.П.Мазовера 2019» проводится выставка ранга CAC / Чемпион РКФ.</p><p>Регистрация собак для участия в выставке производится при предоставлении следующего пакета документов:</p><ul><li>заполненный заявочный лист на одну собаку, подписанный владельцем</li><li>копия родословной собаки или копию метрики щенка (только для классов бэби, щенков, юниоров)</li><li>копия квитанции об оплате добровольного целевого взноса участника</li><li>копии международных рабочих сертификатов и чемпионских сертификатов при регистрации</li><li>в рабочий класс и класс чемпионов.</li></ul><p>Внимание! </p><p>Без предоставления вышеперечисленных сертификатов регистрация на выставку будет производиться в открытый класс.</p><p>Запись на Интернациональные выставки в классы, в которых присуждается CACIB – промежуточный, открытый, рабочий, чемпионов, должна проводиться только по экспортной родословной «EXPORT PEDIGREE» или по родословной на одном из языков FCI «PEDIGREE» .</p><p>Ответственность за правильность предоставленных данных о собаке несет заявитель.</p><p>Исправления и дополнения в заявочном листе не допускаются.</p><p>Перевод собаки из класса в класс допускается только на специализированных (монопородных) выставках в случае получения Чемпионского титула или Международного сертификата по рабочим качествам до окончания регистрации по личному заявлению ее владельца с предоставлением квитанции об оплате добровольного целевого взноса участника на дату перевода собаки из класса в класс.</p>",
    schedule: detailsSchedule,
    judges: [],
    participants: [],
    contests: [],
    prices: {
        prices: priceTableData,
        contests: contestTableData,
    },

};


