export const demoSlides = [
    {
        image: '/media/images/home/01.png',
        link: {to: '/', text: 'Читать<br/>далее'},
        title: 'Хорошая жизнь <br/><span>с собаками 1</span>',
        text: 'Ежедневно РКФ работает над улучшением качества разведения собак в России с главной целью — благополучие собаки.',
        style: {}
    },
    {
        image: '/media/images/home/01.png',
        link: {to: '/', text: 'Читать<br/>далее'},
        title: 'Хорошая жизнь <br/><span>с собаками 2</span>',
        text: 'Ежедневно РКФ работает над улучшением качества разведения собак в России с главной целью — благополучие собаки.',
        style: {}
    },
    {
        image: '/media/images/home/01.png',
        link: {to: '/', text: 'Читать<br/>далее'},
        title: 'Хорошая жизнь <br/><span>с собаками 3</span>',
        text: 'Ежедневно РКФ работает над улучшением качества разведения собак в России с главной целью — благополучие собаки.',
        style: {}
    },
];