export const RKFInfo = {
    aboutTitle: 'О РКФ',
    about: 'Российская кинологическая федерация (РКФ) является некоммерческим, добровольным, самоуправляемым, основанным на членстве союзом общественных объединений, созданным по инициативе общественных объединений, объединившихся на основе общности их интересов для достижения целей, определенных Уставом РКФ.',
    contacts: [
        {
            class: 'pin',
            text: 'Адрес: Москва, Гостиничная, 9'
        },
        {
            class: 'phone',
            text: 'Телефон: +7 (499) 753-22-33'
        },
        {
            class: 'email',
            text: 'E-mail: ',
            link: 'mailto:rkf@rkf.org.ru',
            linkTitle: 'rkf@rkf.org.ru'
        },
        {
            class: 'web',
            text: 'Сайт: ',
            link: 'https://rkf.org.ru',
            linkTitle: 'rkf.org.ru'
        }
    ]
};