import React from 'react';
import * as LoadableModules from "./appModules";

const SERVER = 'http://dev.uep24.ru';
const DEFAULT_PHONE_INPUT_MASK = ['+7', '(', /[1-9]/, /\d/, /\d/, ')', /\d/, /\d/, /\d/, '-', /\d/, /\d/, '-', /\d/, /\d/];
const DEFAULT_PHONE_INPUT_PLACEHOLDER = '+7(   )___-__-__';
const DEFAULT_EMAIL_INPUT_PLACEHOLDER = 'Введите ваш Email';
const LOGIN_URL = '/auth/login';
const REGISTRATION_URL = '/auth/registration';

const appRoutes = [
    {
        exact: true,
        path: '/',
        component: LoadableModules.LoadableHomePage
    },
    {
        exact: true,
        path: '/clubs-map',
        component: LoadableModules.LoadableMapPage
    },
    {
        exact: true,
        path: '/about',
        component: LoadableModules.LoadableAboutPage
    },
    {
        exact: true,
        path: '/search',
        component: LoadableModules.LoadableSearchPage
    },
    {
        exact: true,
        path: '/organizations',
        component: LoadableModules.LoadableOrganizations
    },
    {
        exact: true,
        path: '/rkf',
        component: LoadableModules.LoadableRKFPage
    },
    {
        exact: true,
        path: '/rfls',
        component: LoadableModules.LoadableFederationPage
    },
    {
        exact: true,
        path: '/rfss',
        component: LoadableModules.LoadableFederationPage
    },
    {
        exact: true,
        path: '/oankoo',
        component: LoadableModules.LoadableFederationPage
    },
    {
        exact: true,
        path: '/rfos',
        component: LoadableModules.LoadableFederationPage
    },
    {
        exact: true,
        path: '/exhibitions',
        component: LoadableModules.LoadableExhibitions
    },
    {
        exact: false,
        path: '/exhibitions/:id/edit',
        component: LoadableModules.LoadableExhibitionEdit
    },
    {
        exact: false,
        path: '/exhibitions/:id',
        component: LoadableModules.LoadableExhibition
    },
    {
        exact: true,
        path: '/news/:id/edit',
        component: LoadableModules.LoadableNews
    },
    {
        exact: true,
        path: '/news/:id',
        component: LoadableModules.LoadableNews
    },
    {
        exact: false,
        path: '/reports',
        component: LoadableModules.LoadableReports
    },
    {
        exact: true,
        path: '/recovery',
        component: LoadableModules.LoadablePasswordRecovery
    },
    {
        exact: true,
        path: '/auth/login',
        component: LoadableModules.LoadableLogin
    },
    {
        exact: true,
        path: '/auth/registration',
        component: LoadableModules.LoadableRegistration
    },
    {
        exact: true,
        path: '/not-confirmed',
        component: LoadableModules.LoadableNotConfirmed
    },
    {
        exact: true,
        path: '/kennel/activation',
        component: LoadableModules.LoadableNurseryActivation
    },
    {
        exact: true,
        path: '/kennel/:id',
        component: LoadableModules.LoadableNurseryPage
    },
    {
        exact: false,
        path: '/kennel/:id/documents',
        component: LoadableModules.LoadableNurseryDocuments
    },
    {
        exact: false,
        path: '/client',
        component: LoadableModules.LoadableClient
    },
    {
        exact: true,
        path: '/:id/gallery/:album?/edit',
        component: LoadableModules.LoadableClubGalleryEdit
    },
    {
        exact: true,
        path: '/:id/gallery/:album?',
        component: LoadableModules.LoadableClubGallery
    },
    {
        exact: false,
        path: '/kennel/:id/edit',
        component: LoadableModules.LoadableNurseryEdit
    },
    {
        exact: true,
        path: '/kennel/:id/gallery/:album?/edit',
        component: LoadableModules.LoadableNurseryGalleryEdit
    },
    {
        exact: true,
        path: '/kennel/:id/gallery/:album?',
        component: LoadableModules.LoadableNurseryGallery
    },

    {
        exact: true,
        path: '/:route/news',
        component: LoadableModules.LoadableClubNews
    },
    {
        exact: true,
        path: '/kennel/:route/news',
        component: LoadableModules.LoadableNurseryNews
    },
    {
        exact: false,
        path: '/:route/documents',
        component: LoadableModules.LoadableDocs
    },
    {
        exact: true,
        path: '/:route/document-status',
        component: LoadableModules.LoadableDocumentStatus
    },
    {
        exact: true,
        path: '/:route/document-status/:query',
        component: LoadableModules.LoadableDocumentStatus
    },
    {
        exact: true,
        path: '/:route',
        component: LoadableModules.LoadableClubPage
    }
];

// const mainNav = [
//     {
//         id: 1,
//         title: "Кинологические организации",
//         to: '/organizations',
//         exact: true
//     },
//     {
//         id: 2,
//         title: "Календарь мероприятий",
//         to: '/exhibitions',
//         exact: false
//         // children: [
//         //     {
//         //         id: 2.1,
//         //         title: "Календарь мероприятий",
//         //         to: '/exhibitions',
//         //         exact: false
//         //     },
//         //     {
//         //         id: 2.2,
//         //         title: "Результаты мероприятий CACIB",
//         //         to: '/results/cacib',
//         //         exact: false
//         //     },
//         //     {
//         //         id: 2.3,
//         //         title: "Результаты мероприятий CAC",
//         //         to: '/results/cac',
//         //         exact: false
//         //     },
//         //     {
//         //         id: 2.4,
//         //         title: "Результаты монопородных мероприятий",
//         //         to: '/',
//         //         exact: true,
//         //         disabled: true
//         //     },
//         //     {
//         //         id: 2.5,
//         //         title: "Племенные мероприятия",
//         //         to: '/',
//         //         exact: true,
//         //         disabled: true
//         //     },
//         //     {
//         //         id: 2.6,
//         //         title: "Состязания и испытания рабочих качеств",
//         //         to: '/',
//         //         exact: true,
//         //         disabled: true
//         //     }
//         // ]
//     },
//     {
//         id: 3,
//         title: "О RKF.Online",
//         to: '/about',
//         exact: false
//     }
// ];

const mainNav = [
    {
        id: 1,
        title: "Кинологические организации",
        to: '/organizations',
        exact: true,
        image: <svg id="Layer_1" className="header__nav-icon" data-name="Layer 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 200 200"><path d="M187,77.91a4,4,0,0,1-2.18-.65L100,21.88,15.19,77.26a4,4,0,0,1-4.38-6.7L100,12.32l89.19,58.24A4,4,0,0,1,187,77.91Z"/><path d="M170.26,189.35H29.74a8.89,8.89,0,0,1-8.85-8.91V69a4,4,0,0,1,8,0V180.44a.88.88,0,0,0,.85.91H170.26a.88.88,0,0,0,.85-.91V69a4,4,0,0,1,8,0V180.44A8.89,8.89,0,0,1,170.26,189.35Z"/><circle cx="116.59" cy="101.12" r="5.07"/><circle cx="83.5" cy="101.12" r="5.07"/><path d="M154,84.76a35.48,35.48,0,0,1-9.63-5.9,30.16,30.16,0,0,1-3.95-4.2A14.39,14.39,0,0,0,134,69.55c-4.49-1.83-10.31-2-13.55-.44a6.75,6.75,0,0,0-.66.38c-5.44-2.84-12-4.25-19.66-4.19H100c-.26,0-.51,0-.78,0v0c-7.49-.06-13.94,1.29-19.32,4l-.38-.21c-3.24-1.58-9.06-1.39-13.55.45a14.31,14.31,0,0,0-6.39,5.1,30.16,30.16,0,0,1-4,4.2,35.48,35.48,0,0,1-9.63,5.9c-3.74,1.7-7.26,3.3-9.61,8.25a16.73,16.73,0,0,0-1.56,8c.37,7.06,4.21,12.1,8.3,16.49.91,1,1.66,1.77,2.27,2.42,2.35,2.47,2.54,2.68,3.6,4.83a25.14,25.14,0,0,1,2,6.66c.41,2.14.87,4.56,3.32,5.11a4.11,4.11,0,0,0,.75.08,4,4,0,0,0,2.37-.82c2.59-1.86,5-7.21,5.66-12.3,2.48,9.15,6.55,19.09,10.23,21.76l.06-.08a19,19,0,0,0,10.68,9,10.37,10.37,0,0,0,1.41.35l0,0a13.25,13.25,0,0,0,3,3.08v2.74a11.52,11.52,0,1,0,23,0V157.6a13.56,13.56,0,0,0,3.05-3.1l-.09-.06a9.7,9.7,0,0,0,1.4-.3,18.84,18.84,0,0,0,11.12-9.89c3.59-3.84,7.35-13.64,9.55-22.31.06.41.14.82.19,1.23.56,5.17,3.06,10.71,5.7,12.6a3.77,3.77,0,0,0,3.12.74c2.45-.55,2.91-3,3.32-5.11a25.14,25.14,0,0,1,2-6.66c1.06-2.15,1.25-2.36,3.6-4.83.61-.65,1.36-1.43,2.27-2.42,4.09-4.39,7.93-9.43,8.3-16.49a16.73,16.73,0,0,0-1.56-8C161.21,88.06,157.69,86.46,154,84.76ZM57.46,122.55a18.82,18.82,0,0,1-1.28,5,26.87,26.87,0,0,0-1.93-5.39c-1.45-3-2.11-3.66-4.6-6.28-.61-.64-1.34-1.4-2.23-2.37-4.7-5-6.53-8.53-6.75-12.85a11,11,0,0,1,1-5.22c1.43-3,3.32-3.88,6.76-5.44a40.88,40.88,0,0,0,11.05-6.82,35.71,35.71,0,0,0,4.65-4.93c1.36-1.69,2-2.55,4.08-3.38a15,15,0,0,1,5.1-1.06c-.28.25-.59.48-.86.75C65.39,81.51,61.53,92.2,61,106.39c-.36,1.76-.81,3.5-1.29,5.35A72.9,72.9,0,0,0,57.46,122.55ZM100,166.08a5.73,5.73,0,0,1-5.71-5.74v-7.62a21.64,21.64,0,0,0,2.82-1.89v5.22a2.89,2.89,0,0,0,2.89,2.89h0A2.9,2.9,0,0,0,103,156v-5.32a29.67,29.67,0,0,0,2.84,1.64v8A5.75,5.75,0,0,1,100,166.08Zm27.71-35.36a31.64,31.64,0,0,0-5.23-9.24l-.14-.19a2.89,2.89,0,1,0-4.67,3.42l.14.19c3.4,4.64,6.09,8.31,4.48,15.31-1,4.29-4.93,7.37-8.17,8.41-1.55.5-5-.72-8.27-2.89A8.38,8.38,0,0,1,105,145c-.32-.31-.62-.59-.89-.88-.48-.5-.88-1-1.17-1.3V139c.89-.52,3.6-3.47,5.61-5.73a7.62,7.62,0,0,0,1.74-7.09,4.56,4.56,0,0,0-.37-1c-2.09-3.89-17.66-3.89-19.75,0a5.17,5.17,0,0,0-.37,1,7.62,7.62,0,0,0,1.75,7.09c2,2.26,4.7,5.2,5.6,5.73v3.76c-.29.35-.69.8-1.18,1.3a18,18,0,0,1-5.67,4.17,7.12,7.12,0,0,1-2.24.58h-.21a4.9,4.9,0,0,1-1.91-.23c-3.25-1-7.2-4.13-8.19-8.42-1.61-7,1.09-10.66,4.49-15.31l.77-1a2.9,2.9,0,1,0-4.69-3.4l-.75,1c-2.16,3-4.5,6.15-5.53,10.33-2.77-7-5.39-16.48-5.38-21.77,0-14.41,3.33-24.94,9.84-31.3,4.91-4.79,11.86-7.32,20.63-7.61a50.52,50.52,0,0,1,13.21,1.09c.9.21,1.8.45,2.69.72.51.16,1,.32,1.51.51a26.16,26.16,0,0,1,5,2.56c.6.4,1.19.83,1.75,1.29.28.22.56.46.83.69a4.6,4.6,0,0,0,.79.74c6.51,6.36,9.82,16.89,9.85,31.3C132.73,115.06,130.36,123.83,127.75,130.72Zm31.58-30c-.22,4.32-2.05,7.8-6.75,12.85-.89,1-1.62,1.73-2.23,2.37-2.49,2.62-3.15,3.32-4.6,6.28a26.87,26.87,0,0,0-1.93,5.39,18.82,18.82,0,0,1-1.28-5,52.81,52.81,0,0,0-2.48-10.37c-.64-2.06-1.25-4-1.64-5.91-.6-14.14-4.45-24.79-11.51-31.68-.27-.27-.58-.5-.87-.76a15.29,15.29,0,0,1,5.74,1.08c2,.83,2.72,1.69,4.08,3.38a35.71,35.71,0,0,0,4.65,4.93A40.88,40.88,0,0,0,151.56,90c3.44,1.56,5.33,2.41,6.76,5.44A11,11,0,0,1,159.33,100.7Z"/></svg>,
    },
    {
        id: 2,
        title: "Календарь мероприятий",
        to: '/exhibitions',
        exact: false,
        image: <svg id="Layer_1" className="header__nav-icon" data-name="Layer 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 200 200"><path d="M156.5,180.58H43.5a23.05,23.05,0,0,1-23-23V60.13a23.05,23.05,0,0,1,23-23h113a23.05,23.05,0,0,1,23,23v97.42A23.05,23.05,0,0,1,156.5,180.58ZM43.5,45.1a15,15,0,0,0-15,15v97.42a15,15,0,0,0,15,15h113a15,15,0,0,0,15-15V60.13a15,15,0,0,0-15-15Z"/><path d="M52.54,56.49a4,4,0,0,1-4-4V23.42a4,4,0,0,1,8,0V52.49A4,4,0,0,1,52.54,56.49Z"/><path d="M100,56.49a4,4,0,0,1-4-4V23.42a4,4,0,0,1,8,0V52.49A4,4,0,0,1,100,56.49Z"/><path  d="M147.46,56.49a4,4,0,0,1-4-4V23.42a4,4,0,1,1,8,0V52.49A4,4,0,0,1,147.46,56.49Z"/><path  d="M66.72,112.84H53.9a11,11,0,0,1-11-11V89.06a11,11,0,0,1,11-11H66.72a11,11,0,0,1,11,11v12.82A11,11,0,0,1,66.72,112.84ZM53.9,86.1a3,3,0,0,0-3,3v12.82a3,3,0,0,0,3,3H66.72a3,3,0,0,0,3-3V89.06a3,3,0,0,0-3-3Z"/><path  d="M106.41,112.84H93.59a11,11,0,0,1-11-11V89.06a11,11,0,0,1,11-11h12.82a11,11,0,0,1,11,11v12.82A11,11,0,0,1,106.41,112.84ZM93.59,86.1a3,3,0,0,0-3,3v12.82a3,3,0,0,0,3,3h12.82a3,3,0,0,0,3-3V89.06a3,3,0,0,0-3-3Z"/><path  d="M66.72,155.64H53.9a11,11,0,0,1-11-10.95V131.86a11,11,0,0,1,11-11H66.72a11,11,0,0,1,11,11v12.83A11,11,0,0,1,66.72,155.64ZM53.9,128.91a3,3,0,0,0-3,3v12.83a3,3,0,0,0,3,2.95H66.72a3,3,0,0,0,3-2.95V131.86a3,3,0,0,0-3-3Z"/><path  d="M106.41,155.64H93.59a11,11,0,0,1-11-10.95V131.86a11,11,0,0,1,11-11h12.82a11,11,0,0,1,11,11v12.83A11,11,0,0,1,106.41,155.64ZM93.59,128.91a3,3,0,0,0-3,3v12.83a3,3,0,0,0,3,2.95h12.82a3,3,0,0,0,3-2.95V131.86a3,3,0,0,0-3-3Z"/><path  d="M146.1,112.84H133.28a11,11,0,0,1-11-11V89.06a11,11,0,0,1,11-11H146.1a11,11,0,0,1,11,11v12.82A11,11,0,0,1,146.1,112.84ZM133.28,86.1a3,3,0,0,0-3,3v12.82a3,3,0,0,0,3,3H146.1a3,3,0,0,0,3-3V89.06a3,3,0,0,0-3-3Z"/></svg>,
    },
    {
        id: 3,
        title: "Специалисты",
        to: '/specialists',
        exact: true,
        image: <svg id="Layer_1" className="header__nav-icon" data-name="Layer 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 200 200"><path  d="M145.39,150.13c-2.23-12.41-4.77-26.49-5.78-31.74-2.13-11-10.67-16.49-20.73-19.09a30.79,30.79,0,1,0-37.76,0c-10.06,2.6-18.6,8.13-20.73,19.09-1,5.26-3.55,19.34-5.78,31.77-1.15,6.4-2.26,12.53-3,16.82q3.84,2.33,7.9,4.29c.76-4.15,2.12-11.67,3.54-19.6,2.23-12.4,4.76-26.45,5.77-31.66,1.83-9.43,12.14-14.21,30.7-14.21H100c18.86-.12,29.36,4.69,31.2,14.21,1,5.2,3.53,19.24,5.76,31.64,1.43,7.94,2.79,15.47,3.55,19.62q4.07-2,7.9-4.29C147.65,162.68,146.54,156.54,145.39,150.13ZM77.75,75A22.25,22.25,0,1,1,100,97.26,22.27,22.27,0,0,1,77.75,75Z"/><path  d="M64.39,91.47A39.5,39.5,0,0,1,61,78.87a22.25,22.25,0,1,1,9-29.12,40.1,40.1,0,0,1,6.4-6.09A30.78,30.78,0,1,0,31.11,83.82c-10,2.6-18.59,8.13-20.71,19.07-.3,1.53-.73,3.82-1.23,6.57a92.06,92.06,0,0,0,5.71,16.36c1.64-9.09,3.17-17.52,3.9-21.3C20.63,95,31.09,90.2,50,90.31A73.26,73.26,0,0,1,64.39,91.47Z"/><path  d="M189.6,102.89C187.48,92,178.94,86.42,168.89,83.82a30.78,30.78,0,1,0-45.27-40.16,40.1,40.1,0,0,1,6.4,6.09,22.26,22.26,0,1,1,9,29.12,39.5,39.5,0,0,1-3.43,12.6A73.26,73.26,0,0,1,150,90.31c18.93-.11,29.39,4.69,31.24,14.21.73,3.78,2.26,12.21,3.9,21.3a92.06,92.06,0,0,0,5.71-16.36C190.33,106.71,189.9,104.42,189.6,102.89Z"/></svg>,
        disabled: true,
    },
    {
        id: 4,
        title: "Поиск по базе РКФ",
        to: '/base-search',
        exact: true,
        image: <svg id="Layer_1" className="header__nav-icon" data-name="Layer 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 200 200"><path  d="M69.71,56.89c-3.74,0-36.59-.26-36.59-9.15S66,38.59,69.71,38.59s36.59.26,36.59,9.15-32.85,9.15-36.59,9.15ZM38,47.74c2.24,1.73,12.95,4.57,31.75,4.57s29.51-2.84,31.74-4.57C99.22,46,88.51,43.17,69.71,43.17S40.2,46,38,47.74Zm63.84.35h0Zm0,0"/><path  d="M69.71,75.18c-3.74,0-36.59-.26-36.59-9.15a2.29,2.29,0,0,1,4.56-.26c1.41,1.69,12.23,4.84,32,4.84s30.62-3.15,32-4.84a2.29,2.29,0,0,1,4.56.26c0,8.89-32.85,9.15-36.59,9.15Zm32-9.15Zm-64,0Zm0,0"/><path  d="M69.71,93.47c-3.74,0-36.59-.25-36.59-9.14a2.29,2.29,0,0,1,4.56-.26c1.41,1.68,12.23,4.83,32,4.83s30.62-3.15,32-4.83a2.29,2.29,0,0,1,4.56.26c0,8.89-32.85,9.14-36.59,9.14Zm32-9.15Zm-64,0Zm0,0"/><path  d="M69.71,111.77c-3.74,0-36.59-.26-36.59-9.15V47.74a2.29,2.29,0,0,1,4.58,0v54.63c1.46,1.7,12.28,4.82,32,4.82s30.55-3.12,32-4.82V47.74a2.29,2.29,0,1,1,4.58,0v54.88c0,8.89-32.85,9.15-36.59,9.15Zm0,0"/><path  d="M51.42,81.28a3,3,0,1,1-3.05-3,3.06,3.06,0,0,1,3.05,3Zm0,0"/><path  d="M51.42,63a3,3,0,1,1-3.05-3.05A3,3,0,0,1,51.42,63Zm0,0"/><path  d="M51.42,99.57a3,3,0,1,1-3.05-3,3.06,3.06,0,0,1,3.05,3Zm0,0"/><path  d="M70.33,133.88A58.92,58.92,0,1,1,129.25,75,59,59,0,0,1,70.33,133.88ZM70.33,24A50.92,50.92,0,1,0,121.25,75,51,51,0,0,0,70.33,24Z"/><path  d="M112.91,145.64,95,127.7a4,4,0,1,1,5.66-5.65l12.28,12.27,15.83-15.83-12.28-12.28a4,4,0,1,1,5.66-5.65l17.93,17.93Z"/><path  d="M167.39,192.17a19.15,19.15,0,0,1-13.57-5.62L107.25,140l27.15-27.15L181,159.4a19.2,19.2,0,0,1-13.58,32.77ZM118.56,140l40.92,40.92a11.2,11.2,0,1,0,15.83-15.84L134.4,124.15Z"/><path  d="M140.63,61.57a38.32,38.32,0,0,1-6.72-.82,28.63,28.63,0,0,0-4.19-.59,29,29,0,0,0-3.78.55,39,39,0,0,1-6.94.86,10.59,10.59,0,0,1-7.06-2.21A9.11,9.11,0,0,1,108.79,52a24.51,24.51,0,0,1,5.81-15c4.17-5,9.53-7.8,15.12-7.8s10.95,2.77,15.11,7.8a24.51,24.51,0,0,1,5.81,15,9.14,9.14,0,0,1-3.13,7.36A10.33,10.33,0,0,1,140.63,61.57Z"/><path  d="M122,35.82A9.67,9.67,0,0,1,114,31.3a15.07,15.07,0,0,1-2.43-8.37A15,15,0,0,1,114,14.56a9.26,9.26,0,0,1,15.9,0,15,15,0,0,1,2.43,8.38A15.06,15.06,0,0,1,130,31.3,9.67,9.67,0,0,1,122,35.82Z"/><path  d="M137.44,35.82a9.67,9.67,0,0,1-7.95-4.52,15.07,15.07,0,0,1-2.43-8.37,15.08,15.08,0,0,1,2.43-8.38,9.26,9.26,0,0,1,15.9,0,14.94,14.94,0,0,1,2.43,8.37,15,15,0,0,1-2.43,8.37A9.64,9.64,0,0,1,137.44,35.82Z"/><path  d="M110.47,44.93a8.75,8.75,0,0,1-3.7-.83A11.42,11.42,0,0,1,101,37.47a12,12,0,0,1-.26-7.3,8.77,8.77,0,0,1,5.26-5.9,7.92,7.92,0,0,1,2.86-.52,8.62,8.62,0,0,1,3.7.84,11.39,11.39,0,0,1,5.73,6.63,12,12,0,0,1,.27,7.29,8.83,8.83,0,0,1-5.27,5.91A8.17,8.17,0,0,1,110.47,44.93Z"/><path  d="M149,44.93a8.13,8.13,0,0,1-2.86-.51,8.78,8.78,0,0,1-5.27-5.91,12.07,12.07,0,0,1,.26-7.29,11.39,11.39,0,0,1,5.73-6.63,8.65,8.65,0,0,1,3.7-.84,8,8,0,0,1,2.87.52,8.77,8.77,0,0,1,5.26,5.9,12.07,12.07,0,0,1-.26,7.29,11.41,11.41,0,0,1-5.73,6.64A8.79,8.79,0,0,1,149,44.93Z"/><path  d="M129.72,32.83c4.5,0,8.89,2.31,12.36,6.5a20.87,20.87,0,0,1,5,12.71,5.7,5.7,0,0,1-1.85,4.61A7,7,0,0,1,140.63,58a35.25,35.25,0,0,1-6.08-.77,30.11,30.11,0,0,0-4.83-.64,27.57,27.57,0,0,0-4.44.61c-4,.73-8.46,1.57-11-.59A5.64,5.64,0,0,1,112.37,52a20.81,20.81,0,0,1,5-12.71C120.83,35.14,125.22,32.83,129.72,32.83Z"/><path  d="M122,32.24a6.13,6.13,0,0,1-5-3,11.39,11.39,0,0,1-1.81-6.36A11.4,11.4,0,0,1,117,16.56a5.7,5.7,0,0,1,10,0,11.48,11.48,0,0,1,1.81,6.37A11.47,11.47,0,0,1,127,29.29,6.14,6.14,0,0,1,122,32.24Z"/><path  d="M137.44,32.24a6.13,6.13,0,0,1-5-3,11.39,11.39,0,0,1-1.81-6.36,11.4,11.4,0,0,1,1.81-6.37,5.7,5.7,0,0,1,10,0,11.48,11.48,0,0,1,1.81,6.37,11.47,11.47,0,0,1-1.81,6.36A6.16,6.16,0,0,1,137.44,32.24Z"/><path  d="M104.21,31.18a5.17,5.17,0,0,1,3.09-3.56,4.83,4.83,0,0,1,3.79.21A7.84,7.84,0,0,1,115,32.4a8.55,8.55,0,0,1,.21,5.11,5.21,5.21,0,0,1-3.1,3.56,4.58,4.58,0,0,1-1.6.29,5.25,5.25,0,0,1-2.19-.5,7.81,7.81,0,0,1-3.86-4.58h0A8.36,8.36,0,0,1,104.21,31.18Z"/><path  d="M144.27,37.51a8.47,8.47,0,0,1,.21-5.11,7.77,7.77,0,0,1,3.87-4.57,4.83,4.83,0,0,1,3.79-.21,5.17,5.17,0,0,1,3.09,3.56,8.43,8.43,0,0,1-.21,5.1h0a7.79,7.79,0,0,1-3.87,4.58,5.21,5.21,0,0,1-2.18.5,4.63,4.63,0,0,1-1.61-.29A5.19,5.19,0,0,1,144.27,37.51Z"/></svg>,
        disabled: true,
    },
    {
        id: 5,
        title: "O RKF.Online",
        to: '/about',
        exact: false,
        image: <svg id="Layer_1" className="header__nav-icon" data-name="Layer 1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 200 200"><path  d="M146.67,163.72H53.28a15.24,15.24,0,0,1-15.23-15.23V55.11A15.25,15.25,0,0,1,53.28,39.87h93.39A15.25,15.25,0,0,1,161.9,55.11v93.38A15.24,15.24,0,0,1,146.67,163.72ZM53.28,47.87a7.24,7.24,0,0,0-7.23,7.24v93.38a7.23,7.23,0,0,0,7.23,7.23h93.39a7.23,7.23,0,0,0,7.23-7.23V55.11a7.24,7.24,0,0,0-7.23-7.24Z"/><path  d="M131.54,146.3H68.41a13,13,0,0,1-12.93-12.94V70.23A12.94,12.94,0,0,1,68.41,57.3h63.13a13,13,0,0,1,12.94,12.93v63.13A13,13,0,0,1,131.54,146.3Zm-63.13-81a4.93,4.93,0,0,0-4.93,4.93v63.13a4.94,4.94,0,0,0,4.93,4.94h63.13a5,5,0,0,0,4.94-4.94V70.23a4.94,4.94,0,0,0-4.94-4.93Z"/><path  d="M110.64,125.36H89.31a12.91,12.91,0,0,1-12.9-12.9V91.13a12.92,12.92,0,0,1,12.9-12.9h21.33a12.91,12.91,0,0,1,12.9,12.9v21.33A12.91,12.91,0,0,1,110.64,125.36ZM89.31,86.23a4.91,4.91,0,0,0-4.9,4.9v21.33a4.9,4.9,0,0,0,4.9,4.9h21.33a4.9,4.9,0,0,0,4.9-4.9V91.13a4.91,4.91,0,0,0-4.9-4.9Z"/><path  d="M29,153.57H14.58a4,4,0,0,1,0-8H29a4,4,0,0,1,0,8Z"/><path  d="M29,134.45H14.58a4,4,0,0,1,0-8H29a4,4,0,1,1,0,8Z"/><path  d="M29,115.33H14.58a4,4,0,1,1,0-8H29a4,4,0,0,1,0,8Z"/><path  d="M29,96.21H14.58a4,4,0,1,1,0-8H29a4,4,0,1,1,0,8Z"/><path  d="M29,77.09H14.58a4,4,0,1,1,0-8H29a4,4,0,0,1,0,8Z"/><path  d="M29,58H14.58a4,4,0,1,1,0-8H29a4,4,0,0,1,0,8Z"/><path  d="M185.42,153.57H171a4,4,0,0,1,0-8h14.4a4,4,0,1,1,0,8Z"/><path  d="M185.42,134.45H171a4,4,0,0,1,0-8h14.4a4,4,0,1,1,0,8Z"/><path  d="M185.42,115.33H171a4,4,0,0,1,0-8h14.4a4,4,0,0,1,0,8Z"/><path  d="M185.42,96.21H171a4,4,0,0,1,0-8h14.4a4,4,0,0,1,0,8Z"/><path  d="M185.42,77.09H171a4,4,0,0,1,0-8h14.4a4,4,0,0,1,0,8Z"/><path  d="M185.42,58H171a4,4,0,0,1,0-8h14.4a4,4,0,0,1,0,8Z"/><path  d="M52.2,34.75a4,4,0,0,1-4-4V16.35a4,4,0,0,1,8,0v14.4A4,4,0,0,1,52.2,34.75Z"/><path  d="M71.32,34.75a4,4,0,0,1-4-4V16.35a4,4,0,1,1,8,0v14.4A4,4,0,0,1,71.32,34.75Z"/><path  d="M90.44,34.75a4,4,0,0,1-4-4V16.35a4,4,0,0,1,8,0v14.4A4,4,0,0,1,90.44,34.75Z"/><path  d="M109.56,34.75a4,4,0,0,1-4-4V16.35a4,4,0,0,1,8,0v14.4A4,4,0,0,1,109.56,34.75Z"/><path  d="M128.68,34.75a4,4,0,0,1-4-4V16.35a4,4,0,1,1,8,0v14.4A4,4,0,0,1,128.68,34.75Z"/><path  d="M147.8,34.75a4,4,0,0,1-4-4V16.35a4,4,0,1,1,8,0v14.4A4,4,0,0,1,147.8,34.75Z"/><path  d="M52.2,191.2a4,4,0,0,1-4-4V172.79a4,4,0,0,1,8,0V187.2A4,4,0,0,1,52.2,191.2Z"/><path  d="M71.32,191.2a4,4,0,0,1-4-4V172.79a4,4,0,0,1,8,0V187.2A4,4,0,0,1,71.32,191.2Z"/><path  d="M90.44,191.2a4,4,0,0,1-4-4V172.79a4,4,0,0,1,8,0V187.2A4,4,0,0,1,90.44,191.2Z"/><path  d="M109.56,191.2a4,4,0,0,1-4-4V172.79a4,4,0,0,1,8,0V187.2A4,4,0,0,1,109.56,191.2Z"/><path  d="M128.68,191.2a4,4,0,0,1-4-4V172.79a4,4,0,0,1,8,0V187.2A4,4,0,0,1,128.68,191.2Z"/><path  d="M147.8,191.2a4,4,0,0,1-4-4V172.79a4,4,0,0,1,8,0V187.2A4,4,0,0,1,147.8,191.2Z"/></svg>,
    }
];

const WEEKDAYS = [
    {
        "id": 1,
        "name": "Понедельник",
        "short_name": "Пн",
        "name_eng": "Monday",
        "short_name_eng": "Mo",
        "week_day_number": 1
    },
    {
        "id": 2,
        "name": "Вторник",
        "short_name": "Вт",
        "name_eng": "Tuesday",
        "short_name_eng": "Tu",
        "week_day_number": 2
    },
    {
        "id": 3,
        "name": "Среда",
        "short_name": "Ср",
        "name_eng": "Wednesday",
        "short_name_eng": "We",
        "week_day_number": 3
    },
    {
        "id": 4,
        "name": "Четверг",
        "short_name": "Чт",
        "name_eng": "Thursday",
        "short_name_eng": "Th",
        "week_day_number": 4
    },
    {
        "id": 5,
        "name": "Пятница",
        "short_name": "Пт",
        "name_eng": "Friday",
        "short_name_eng": "Fr",
        "week_day_number": 5
    },
    {
        "id": 6,
        "name": "Суббота",
        "short_name": "Сб",
        "name_eng": "Saturday",
        "short_name_eng": "Sa",
        "week_day_number": 6
    },
    {
        "id": 7,
        "name": "Воскресенье",
        "short_name": "Вс",
        "name_eng": "Sunday",
        "short_name_eng": "Su",
        "week_day_number": 7
    }
];

const WEEKDAYS_SHORT = ['Вс', 'Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб'];

const MONTHS = [
    'Январь',
    'Февраль',
    'Март',
    'Апрель',
    'Май',
    'Июнь',
    'Июль',
    'Август',
    'Сентябрь',
    'Октябрь',
    'Ноябрь',
    'Декабрь',
];

const DEFAULT_IMG = {
    clubAvatar: '/static/icons/default/club-avatar.svg',
    exhibitionPicture: '/static/images/exhibitions/default.png',
    authPicture: '/static/images/registration/banner.png',
    noImage: '/static/images/noimg/icon-no-image.svg',
    noNews: '/static/images/news/no-news-small.png',
    emptyGallery: '/static/images/noimg/empty-gallery.png'
};

const BAD_SITES = [
    'zooportal.pro',
    'kinolog.org'
];

const responsiveSliderConfig = [
    {
        breakpoint: 1181,
        settings: {
            slidesToShow: 2,
            slidesToScroll: 2,
            touchThreshold: 5,
            variableWidth: false
        }
    },
    {
        breakpoint: 768,
        settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
            centerMode: true,
            arrows: false,
            centerPadding: '25px',
            variableWidth: false
        }
    },
    {
        breakpoint: 561,
        settings: {
            slidesToShow: 1,
            slidesToScroll: 1,
            centerMode: true,
            arrows: false,
            centerPadding: '25px',
            variableWidth: false
        }
    }
];

export {
    WEEKDAYS,
    WEEKDAYS_SHORT,
    MONTHS,
    SERVER,
    appRoutes,
    mainNav,
    responsiveSliderConfig,
    DEFAULT_PHONE_INPUT_MASK,
    DEFAULT_PHONE_INPUT_PLACEHOLDER,
    DEFAULT_EMAIL_INPUT_PLACEHOLDER,
    LOGIN_URL,
    REGISTRATION_URL,
    DEFAULT_IMG,
    BAD_SITES
}
